#include <iostream>
using namespace std;
int main() {
    int salary[4] = {100,200,300,400};
    salary[1]=250;
    for (int i = 0; i < 4; i++)
    {
        cout<<"The salary at index "<<i<<" is "<<salary[i]<<endl;
    }
    cout<<"---Using Print Operations---"<<endl;
    int* p=salary;
    cout<<"*(p) "<<*(p)<<endl;
    cout<<"*(p++) "<<*(p++)<<endl;
    cout<<"*(p++) "<<*(p++)<<endl;
    cout<<"*(++p) "<<*(++p)<<endl;
    return 0;
// यह जो ऊपर हुआ, वो अब समझ। सबसे पहले `cout p` लिखा गया। इसका मतलब है कि `p` अगर `p` के साथ कुछ भी नहीं है। तो `p0` वाली value को print कर देगा। उसने `p0` वाली value print कर दी, जो कि 100 है। फिर आया `p++`, `p++`, और `++p`. अब `p++` का मतलब यह होता है कि इससे पहले वाले step में अगर 100 print हुआ है, तो `p++` का मतलब है पहले वो 100 print होगा और फिर वो आगे बढ़ जाएगा। 100 print कर दिया उसने वापस। अब जब वो इससे नीचे गया, third line पे 14th line पे गया, तब इससे एक आगे बढ़ चुका पहले तो अब उससे आगे जो बढ़ चुका वो 200 था। अब वो 200 पहले print होगा और उससे एक और आगे बढ़ जाएगा, तो 200 print हो गया और उससे एक आगे बढ़ गया। उससे आगे बढ़ा तो वो 300 पहुंच गया। अब 300 पहुंच गया तो अब `++p` लिखा है। `++p` का मतलब है पहले बढ़ेगा, तो 300 से 400 चला गया और फिर print होगा, तो वो print हो गया 400।  
    
    

}